app/controllers/comments_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "ds"], ["body", "dw"], ["product_id", 5], ["created_at", "2023-07-20 04:55:51.001420"], ["updated_at", "2023-07-20 04:55:51.001420"]]
---
def create
@product = Product.find(params[:product_id])
@comment = @product.comments.create(comment_params)