app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @products = Product.find(params[:id])

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "hdd"], ["price", "88"], ["created_at", "2023-07-20 05:37:05.843725"], ["updated_at", "2023-07-20 05:37:05.843725"]]
---
  def create
    @products = Product.new(product_params)
    if @products.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @products = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", "8855"], ["updated_at", "2023-07-20 05:21:42.922535"], ["id", 5]]
---
  def update
    @products = Product.find(params[:id])
    @products.update(product_params)