app/views/products/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = $1  [["product_id", 2]]
---
  </thead>
<%@products.comments.each do |comment|%>